waveshareteam/ESP32-P4-WIFI6-DB-POE-ETH/components/waveshare_bsp/esp32_p4_wifi6_db_poe_eth/esp32_p4_wifi6_db_poe_eth.c
    const sd_pwr_ctrl_ldo_config_t ldo_config = {
        .ldo_chan_id = BSP_SD_PWR_CTRL_LDO_CHAN,
    };
    return sd_pwr_ctrl_new_on_chip_ldo(&ldo_config, &s_sdcard_pwr_ctrl);
#else
    return ESP_OK;
#endif
}

static esp_err_t bsp_sdcard_power_ctrl_deinit(void)
{
#if SOC_SDMMC_IO_POWER_EXTERNAL
    if (s_sdcard_pwr_ctrl == NULL) {
        return ESP_OK;
    }

    esp_err_t ret = sd_pwr_ctrl_del_on_chip_ldo(s_sdcard_pwr_ctrl);
    if (ret == ESP_OK) {
        s_sdcard_pwr_ctrl = NULL;
    }
    return ret;
#else
    return ESP_OK;
#endif
}

static esp_err_t bsp_sdcard_power_on(void)
{
    const gpio_config_t power_config = {
        .pin_bit_mask = BIT64(BSP_SD_VDD_EN),
        .mode = GPIO_MODE_OUTPUT,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE,
    };
    ESP_RETURN_ON_ERROR(gpio_config(&power_config), TAG, "Configure SD card VDD_EN failed");
    ESP_RETURN_ON_ERROR(gpio_set_level(BSP_SD_VDD_EN, !BSP_SD_VDD_EN_ACTIVE_LEVEL), TAG,
                        "Disable SD card power before reset failed");
    vTaskDelay(pdMS_TO_TICKS(100));
    ESP_RETURN_ON_ERROR(gpio_set_level(BSP_SD_VDD_EN, BSP_SD_VDD_EN_ACTIVE_LEVEL), TAG,
                        "Enable SD card power failed");
    return ESP_OK;
}

static esp_err_t bsp_sdcard_power_off(void)
{
    return gpio_set_level(BSP_SD_VDD_EN, !BSP_SD_VDD_EN_ACTIVE_LEVEL);
}

esp_err_t bsp_sdcard_sdmmc_mount(bsp_sdcard_cfg_t *cfg)
{
    assert(cfg);
    ESP_RETURN_ON_FALSE(bsp_sdcard == NULL, ESP_ERR_INVALID_STATE, TAG, "SD card is already mounted");
    esp_err_t ret = bsp_sdcard_power_ctrl_init();
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Initialize SD card IO power failed: %s", esp_err_to_name(ret));
        return ret;
    }

    ret = bsp_sdcard_power_on();
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Enable SD card power failed: %s", esp_err_to_name(ret));
        esp_err_t ldo_ret = bsp_sdcard_power_ctrl_deinit();
        if (ldo_ret != ESP_OK) {
            ESP_LOGE(TAG, "Release SD card IO power after power-on failure failed: %s",
                     esp_err_to_name(ldo_ret));
        }
        return ret;
    }
    const esp_vfs_fat_sdmmc_mount_config_t mount_config = {
#ifdef CONFIG_BSP_SD_FORMAT_ON_MOUNT_FAIL
        .format_if_mount_failed = true,
#else
        .format_if_mount_failed = false,
#endif
        .max_files = 5,
        .allocation_unit_size = 64 * 1024,
    };
    sdmmc_host_t host;
    sdmmc_slot_config_t slot_config;
    const esp_vfs_fat_sdmmc_mount_config_t *effective_mount = cfg->mount;
    const sdmmc_host_t *effective_host = cfg->host;
    const sdmmc_slot_config_t *effective_slot = cfg->slot;
    if (effective_mount == NULL) {
        effective_mount = &mount_config;
    }
    if (effective_host == NULL) {
        bsp_sdcard_get_sdmmc_host(SDMMC_HOST_SLOT_0, &host);
        effective_host = &host;
#if SOC_SDMMC_IO_POWER_EXTERNAL
    } else if (s_sdcard_pwr_ctrl != NULL && effective_host->pwr_ctrl_handle == NULL) {
        host = *effective_host;
        host.pwr_ctrl_handle = s_sdcard_pwr_ctrl;
        effective_host = &host;
#endif
    }
    if (effective_slot == NULL) {
        bsp_sdcard_sdmmc_get_slot(SDMMC_HOST_SLOT_0, &slot_config);
        effective_slot = &slot_config;
    }

    ret = esp_vfs_fat_sdmmc_mount(BSP_SD_MOUNT_POINT, effective_host, effective_slot,
                                  effective_mount, &bsp_sdcard);
    if (ret != ESP_OK) {
        bsp_sdcard = NULL;
        esp_err_t power_ret = bsp_sdcard_power_off();
        if (power_ret != ESP_OK) {
            ESP_LOGE(TAG, "Disable SD card power after mount failure failed: %s",
                     esp_err_to_name(power_ret));
        }
        esp_err_t ldo_ret = bsp_sdcard_power_ctrl_deinit();
        if (ldo_ret != ESP_OK) {
            ESP_LOGE(TAG, "Release SD card IO power after mount failure failed: %s",
                     esp_err_to_name(ldo_ret));
        }
    }
    return ret;
}

esp_err_t bsp_sdcard_mount(void)
{
    bsp_sdcard_cfg_t cfg = {0};
    return bsp_sdcard_sdmmc_mount(&cfg);
}

esp_err_t bsp_sdcard_unmount(void)
{
    ESP_RETURN_ON_FALSE(bsp_sdcard != NULL, ESP_ERR_INVALID_STATE, TAG,
                        "SD card is not mounted");
    esp_err_t ret = esp_vfs_fat_sdcard_unmount(BSP_SD_MOUNT_POINT, bsp_sdcard);
    if (ret != ESP_OK) {
        return ret;
    }
    bsp_sdcard = NULL;
    esp_err_t power_ret = bsp_sdcard_power_off();
    esp_err_t ldo_ret = bsp_sdcard_power_ctrl_deinit();
    if (power_ret != ESP_OK) {
        return power_ret;
    }
    return ldo_ret;
}

static void bsp_audio_reset(void)
{
    if (i2s_data_if != NULL) {
        audio_codec_delete_data_if(i2s_data_if);
        i2s_data_if = NULL;
    }
    if (i2s_tx_chan != NULL) {
        (void)i2s_channel_disable(i2s_tx_chan);
        (void)i2s_del_channel(i2s_tx_chan);
        i2s_tx_chan = NULL;
    }
    if (i2s_rx_chan != NULL) {
        (void)i2s_channel_disable(i2s_rx_chan);
        (void)i2s_del_channel(i2s_rx_chan);
        i2s_rx_chan = NULL;
    }
}

esp_err_t bsp_audio_init(const i2s_std_config_t *i2s_config)
{
    if (i2s_tx_chan && i2s_rx_chan && i2s_data_if) {
        return ESP_OK;
    }
    bsp_audio_reset();

    i2s_chan_config_t chan_config =
        I2S_CHANNEL_DEFAULT_CONFIG(CONFIG_BSP_I2S_NUM, I2S_ROLE_MASTER);
    chan_config.auto_clear = true;
    esp_err_t ret = i2s_new_channel(&chan_config, &i2s_tx_chan, &i2s_rx_chan);
    ESP_GOTO_ON_ERROR(ret, fail, TAG, "Create I2S channels failed");

    const i2s_std_config_t default_config = BSP_I2S_DUPLEX_MONO_CFG(48000);
    const i2s_std_config_t *config = i2s_config ? i2s_config : &default_config;
    i2s_mclk_multiple = config->clk_cfg.mclk_multiple ? config->clk_cfg.mclk_multiple : 256;
    ret = i2s_channel_init_std_mode(i2s_tx_chan, config);
    ESP_GOTO_ON_ERROR(ret, fail, TAG, "Initialize I2S TX failed");
    ret = i2s_channel_init_std_mode(i2s_rx_chan, config);
    ESP_GOTO_ON_ERROR(ret, fail, TAG, "Initialize I2S RX failed");
    ret = i2s_channel_enable(i2s_tx_chan);
    ESP_GOTO_ON_ERROR(ret, fail, TAG, "Enable I2S TX failed");
    ret = i2s_channel_enable(i2s_rx_chan);
    ESP_GOTO_ON_ERROR(ret, fail, TAG, "Enable I2S RX failed");

    audio_codec_i2s_cfg_t i2s_cfg = {
        .port = CONFIG_BSP_I2S_NUM,
        .tx_handle = i2s_tx_chan,
        .rx_handle = i2s_rx_chan,
    };
    i2s_data_if = audio_codec_new_i2s_data(&i2s_cfg);
    if (i2s_data_if == NULL) {
        ret = ESP_ERR_NO_MEM;
        goto fail;
    }
    return ESP_OK;

