waveshareteam/ESP32-P4-WIFI6-DB-POE-ETH/components/waveshare_bsp/esp32_p4_wifi6_db_poe_eth/esp32_p4_wifi6_db_poe_eth.c
    ret = bsp_display_brightness_init();
    ESP_GOTO_ON_ERROR(ret, err, LCD_TAG, "Backlight init failed");
    ret = bsp_enable_dsi_phy_power();
    ESP_GOTO_ON_ERROR(ret, err, LCD_TAG, "DSI PHY power failed");

    const esp_lcd_dsi_bus_config_t bus_config = {
        .bus_id = 0,
        .num_data_lanes = BSP_LCD_MIPI_DSI_LANE_NUM,
        .phy_clk_src = config ? config->dsi_bus.phy_clk_src : 0,
        .lane_bit_rate_mbps =
            (config != NULL && config->dsi_bus.lane_bit_rate_mbps != 0) ?
            config->dsi_bus.lane_bit_rate_mbps : BSP_LCD_MIPI_DSI_LANE_BITRATE_MBPS,
    };
    ret = esp_lcd_new_dsi_bus(&bus_config, &s_mipi_dsi_bus);
    ESP_GOTO_ON_ERROR(ret, err, LCD_TAG, "Create MIPI DSI bus failed");

    const esp_lcd_dbi_io_config_t dbi_config = {
        .virtual_channel = 0,
        .lcd_cmd_bits = 8,
        .lcd_param_bits = 8,
    };
    ESP_GOTO_ON_ERROR(esp_lcd_new_panel_io_dbi(s_mipi_dsi_bus, &dbi_config, &io),
                      err, LCD_TAG, "Create MIPI DBI IO failed");

#if CONFIG_BSP_LCD_TYPE_800_1280_10_1_INCH_A || CONFIG_BSP_LCD_TYPE_800_1280_8_INCH_A
#if CONFIG_BSP_LCD_TYPE_800_1280_10_1_INCH_A
    ESP_LOGI(LCD_TAG, "Install Waveshare 10.1-DSI-TOUCH-A JD9365 panel");
#else
    ESP_LOGI(LCD_TAG, "Install Waveshare 8-DSI-TOUCH-A JD9365 panel");
#endif
#if CONFIG_BSP_LCD_COLOR_FORMAT_RGB888
    esp_lcd_dpi_panel_config_t dpi_config =
        JD9365_800_1280_PANEL_60HZ_DPI_CONFIG(LCD_COLOR_PIXEL_FORMAT_RGB888);
#else
    esp_lcd_dpi_panel_config_t dpi_config =
        JD9365_800_1280_PANEL_60HZ_DPI_CONFIG(LCD_COLOR_PIXEL_FORMAT_RGB565);
#endif
    dpi_config.num_fbs = (config != NULL && config->num_fbs != 0) ?
                         config->num_fbs : CONFIG_BSP_LCD_DPI_BUFFER_NUMS;

    jd9365_vendor_config_t vendor_config = {
        .mipi_config = {
            .lane_num = BSP_LCD_MIPI_DSI_LANE_NUM,
            .dsi_bus = s_mipi_dsi_bus,
            .dpi_config = &dpi_config,
        },
    };
    const esp_lcd_panel_dev_config_t panel_config = {
        .reset_gpio_num = BSP_LCD_RST,
        .rgb_ele_order = BSP_LCD_COLOR_SPACE,
        .bits_per_pixel = BSP_LCD_BITS_PER_PIXEL,
        .vendor_config = &vendor_config,
    };

    ESP_GOTO_ON_ERROR(esp_lcd_new_panel_jd9365(io, &panel_config, &panel), err, LCD_TAG, "Create JD9365 panel failed");
#elif CONFIG_BSP_LCD_TYPE_720_1280_7_INCH_A
    ESP_LOGI(LCD_TAG, "Install Waveshare 7-DSI-TOUCH-A ILI9881C panel");
#if CONFIG_BSP_LCD_COLOR_FORMAT_RGB888
    esp_lcd_dpi_panel_config_t dpi_config =
        ILI9881C_720_1280_PANEL_60HZ_DPI_CONFIG(LCD_COLOR_PIXEL_FORMAT_RGB888);
#else
    esp_lcd_dpi_panel_config_t dpi_config =
        ILI9881C_720_1280_PANEL_60HZ_DPI_CONFIG(LCD_COLOR_PIXEL_FORMAT_RGB565);
#endif
    dpi_config.num_fbs = (config != NULL && config->num_fbs != 0) ?
                         config->num_fbs : CONFIG_BSP_LCD_DPI_BUFFER_NUMS;

    ili9881c_vendor_config_t vendor_config = {
        .mipi_config = {
            .lane_num = BSP_LCD_MIPI_DSI_LANE_NUM,
            .dsi_bus = s_mipi_dsi_bus,
            .dpi_config = &dpi_config,
        },
    };
    const esp_lcd_panel_dev_config_t panel_config = {
        .reset_gpio_num = BSP_LCD_RST,
        .rgb_ele_order = BSP_LCD_COLOR_SPACE,
        .bits_per_pixel = BSP_LCD_BITS_PER_PIXEL,
        .vendor_config = &vendor_config,
    };

    ESP_GOTO_ON_ERROR(esp_lcd_new_panel_ili9881c(io, &panel_config, &panel),
                      err, LCD_TAG, "Create ILI9881C panel failed");
#elif CONFIG_BSP_LCD_TYPE_720_1280_5_INCH_A
    ESP_LOGI(LCD_TAG, "Install Waveshare 5-DSI-TOUCH-A HX8394 panel");
#if CONFIG_BSP_LCD_COLOR_FORMAT_RGB888
    esp_lcd_dpi_panel_config_t dpi_config =
        HX8394_720_1280_PANEL_30HZ_DPI_CONFIG(LCD_COLOR_PIXEL_FORMAT_RGB888);
#else
    esp_lcd_dpi_panel_config_t dpi_config =
        HX8394_720_1280_PANEL_30HZ_DPI_CONFIG(LCD_COLOR_PIXEL_FORMAT_RGB565);
#endif
    dpi_config.num_fbs = (config != NULL && config->num_fbs != 0) ?
                         config->num_fbs : CONFIG_BSP_LCD_DPI_BUFFER_NUMS;

    hx8394_vendor_config_t vendor_config = {
        .mipi_config = {
            .lane_num = BSP_LCD_MIPI_DSI_LANE_NUM,
            .dsi_bus = s_mipi_dsi_bus,
            .dpi_config = &dpi_config,
        },
    };
    const esp_lcd_panel_dev_config_t panel_config = {
        .reset_gpio_num = BSP_LCD_RST,
        .rgb_ele_order = BSP_LCD_COLOR_SPACE,
        .bits_per_pixel = BSP_LCD_BITS_PER_PIXEL,
        .vendor_config = &vendor_config,
    };

    ESP_GOTO_ON_ERROR(esp_lcd_new_panel_hx8394(io, &panel_config, &panel),
                      err, LCD_TAG, "Create HX8394 panel failed");
#else
#error "Unsupported LCD type"
#endif

    ESP_GOTO_ON_ERROR(esp_lcd_panel_reset(panel), err, LCD_TAG, "Reset LCD panel failed");
    ESP_GOTO_ON_ERROR(esp_lcd_panel_init(panel), err, LCD_TAG, "Initialize LCD panel failed");
    ESP_GOTO_ON_ERROR(esp_lcd_panel_disp_on_off(panel, true), err, LCD_TAG, "Turn on LCD panel failed");
    ret_handles->mipi_dsi_bus = s_mipi_dsi_bus;
    ret_handles->io = io;
    ret_handles->panel = panel;
    ret_handles->control = NULL;
    s_display_handles = *ret_handles;
    ESP_LOGI(LCD_TAG, "MIPI-DSI display initialized: %dx%d",
             BSP_LCD_H_RES, BSP_LCD_V_RES);
    return ESP_OK;

err:
    if (panel != NULL) {
        esp_lcd_panel_del(panel);
    }
    if (io != NULL) {
        esp_lcd_panel_io_del(io);
    }
    if (s_mipi_dsi_bus != NULL) {
        esp_lcd_del_dsi_bus(s_mipi_dsi_bus);
        s_mipi_dsi_bus = NULL;
    }
    if (s_mipi_phy_ldo != NULL) {
        esp_err_t cleanup_ret = esp_ldo_release_channel(s_mipi_phy_ldo);
        if (cleanup_ret != ESP_OK) {
            ESP_LOGE(LCD_TAG, "Release MIPI DSI PHY LDO failed: %s",
                     esp_err_to_name(cleanup_ret));
        }
        s_mipi_phy_ldo = NULL;
    }
    esp_err_t cleanup_ret = bsp_display_brightness_deinit();
    if (cleanup_ret != ESP_OK) {
        ESP_LOGE(LCD_TAG, "Deinitialize backlight after display failure failed: %s",
                 esp_err_to_name(cleanup_ret));
    }
    return ret;
}

esp_lcd_panel_handle_t bsp_display_get_panel_handle(void)
{
    return s_display_handles.panel;
}

void bsp_display_delete(void)
{
    if (s_display_handles.panel) {
        esp_err_t ret = esp_lcd_panel_del(s_display_handles.panel);
        if (ret != ESP_OK) {
            ESP_LOGE(LCD_TAG, "Delete LCD panel failed: %s", esp_err_to_name(ret));
        }
        s_display_handles.panel = NULL;
    }
    if (s_display_handles.io) {
        esp_err_t ret = esp_lcd_panel_io_del(s_display_handles.io);
        if (ret != ESP_OK) {
            ESP_LOGE(LCD_TAG, "Delete LCD panel IO failed: %s", esp_err_to_name(ret));
        }
        s_display_handles.io = NULL;
    }
    if (s_mipi_dsi_bus) {
        esp_err_t ret = esp_lcd_del_dsi_bus(s_mipi_dsi_bus);
        if (ret != ESP_OK) {
            ESP_LOGE(LCD_TAG, "Delete MIPI DSI bus failed: %s", esp_err_to_name(ret));
        }
        s_mipi_dsi_bus = NULL;
        s_display_handles.mipi_dsi_bus = NULL;
    }
    if (s_mipi_phy_ldo) {
        esp_err_t ret = esp_ldo_release_channel(s_mipi_phy_ldo);
        if (ret != ESP_OK) {
            ESP_LOGE(LCD_TAG, "Release MIPI DSI PHY LDO failed: %s", esp_err_to_name(ret));
        }
        s_mipi_phy_ldo = NULL;
    }
    esp_err_t ret = bsp_display_brightness_deinit();
    if (ret != ESP_OK) {
        ESP_LOGE(LCD_TAG, "Deinitialize backlight failed: %s", esp_err_to_name(ret));
    }
}

esp_err_t bsp_touch_new(const bsp_touch_config_t *config, esp_lcd_touch_handle_t *ret_touch)
{
    ESP_RETURN_ON_FALSE(ret_touch != NULL, ESP_ERR_INVALID_ARG, LCD_TAG, "Invalid touch handle");
    ESP_RETURN_ON_ERROR(bsp_i2c_init(), LCD_TAG, "Initialize touch I2C bus failed");

