waveshareteam/ESP32-P4-WIFI6-DB-POE-ETH/components/waveshare_bsp/esp32_p4_wifi6_db_poe_eth/esp32_p4_wifi6_db_poe_eth.c
lv_indev_t *bsp_display_get_input_dev(void)
{
    return s_touch_indev;
}

void bsp_display_rotate(lv_display_t *display, lv_disp_rotation_t rotation)
{
    lv_disp_set_rotation(display, rotation);
}

bool bsp_display_lock(uint32_t timeout_ms)
{
    return esp_lv_adapter_lock(timeout_ms) == ESP_OK;
}

void bsp_display_unlock(void)
{
    esp_lv_adapter_unlock();
}

esp_err_t bsp_display_set_dummy_draw(bool enable)
{
    if (s_display == NULL) {
        return ESP_ERR_INVALID_STATE;
    }
    return esp_lv_adapter_set_dummy_draw(s_display, enable);
}

void *bsp_display_get_free_frame_buffer(void)
{
    if (s_display == NULL) {
        return NULL;
    }
    return esp_lv_adapter_dummy_draw_get_free_buf(s_display);
}

esp_err_t bsp_display_flush_frame_buffer(void *frame_buffer)
{
    if (s_display == NULL) {
        return ESP_ERR_INVALID_STATE;
    }
    if (frame_buffer == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    return esp_lv_adapter_dummy_draw_flush_buf(s_display, frame_buffer);
}
#endif

static void usb_lib_task(void *arg)
{
    (void)arg;
    while (!atomic_load(&usb_host_stop_requested)) {
        uint32_t event_flags = 0;
        esp_err_t ret = usb_host_lib_handle_events(pdMS_TO_TICKS(100), &event_flags);
        if (ret == ESP_ERR_TIMEOUT) {
            continue;
        }
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "USB Host event handling failed: %s", esp_err_to_name(ret));
            break;
        }
        if (event_flags & USB_HOST_LIB_EVENT_FLAGS_NO_CLIENTS) {
            ret = usb_host_device_free_all();
            if (ret != ESP_OK) {
                ESP_LOGE(TAG, "USB Host device cleanup failed: %s", esp_err_to_name(ret));
            }
        }
        if (event_flags & USB_HOST_LIB_EVENT_FLAGS_ALL_FREE) {
            ESP_LOGI(TAG, "USB: All devices freed");
        }
    }
    usb_host_task = NULL;
    if (usb_host_done_sem != NULL) {
        xSemaphoreGive(usb_host_done_sem);
    }
    vTaskDelete(NULL);
}

esp_err_t bsp_usb_host_start(bsp_usb_host_power_mode_t mode, bool limit_500mA)
{
    (void)mode;
    (void)limit_500mA;
    ESP_RETURN_ON_FALSE(usb_host_task == NULL, ESP_ERR_INVALID_STATE, TAG,
                        "USB Host is already running");
    if (usb_host_done_sem == NULL) {
        usb_host_done_sem = xSemaphoreCreateBinary();
        ESP_RETURN_ON_FALSE(usb_host_done_sem != NULL, ESP_ERR_NO_MEM, TAG,
                            "Create USB Host completion semaphore failed");
    }
    while (xSemaphoreTake(usb_host_done_sem, 0) == pdTRUE) {
    }
    atomic_store(&usb_host_stop_requested, false);
    const usb_host_config_t host_config = {
        .skip_phy_setup = false,
        .intr_flags = ESP_INTR_FLAG_LEVEL1,
    };
    esp_err_t ret = usb_host_install(&host_config);
    if (ret != ESP_OK) {
        vSemaphoreDelete(usb_host_done_sem);
        usb_host_done_sem = NULL;
        return ret;
    }
    if (xTaskCreate(usb_lib_task, "usb_lib", 4096, NULL, 10, &usb_host_task) != pdTRUE) {
        (void)usb_host_uninstall();
        vSemaphoreDelete(usb_host_done_sem);
        usb_host_done_sem = NULL;
        return ESP_ERR_NO_MEM;
    }
    return ESP_OK;
}

esp_err_t bsp_usb_host_stop(void)
{
    if (usb_host_task != NULL) {
        atomic_store(&usb_host_stop_requested, true);
        ESP_RETURN_ON_FALSE(
            usb_host_done_sem != NULL &&
            xSemaphoreTake(usb_host_done_sem, pdMS_TO_TICKS(1000)) == pdTRUE,
            ESP_ERR_TIMEOUT, TAG, "Timed out waiting for USB Host task to stop"
        );
    }

    esp_err_t ret = usb_host_uninstall();
    if (ret != ESP_OK) {
        atomic_store(&usb_host_stop_requested, false);
        if (usb_host_done_sem != NULL &&
            xTaskCreate(usb_lib_task, "usb_lib", 4096, NULL, 10, &usb_host_task) != pdTRUE) {
            ESP_LOGE(TAG, "Restart USB Host task after uninstall failure failed");
        }
        return ret;
    }
    if (usb_host_done_sem != NULL) {
        vSemaphoreDelete(usb_host_done_sem);
        usb_host_done_sem = NULL;
    }
    return ESP_OK;
}

esp_err_t bsp_camera_start(const bsp_camera_cfg_t *cfg)
{
    (void)cfg;
    BSP_ERROR_CHECK_RETURN_ERR(bsp_i2c_init());
    const esp_video_init_csi_config_t csi_config = {
        .sccb_config = {
            .init_sccb = false,
            .i2c_handle = i2c_handle,
            .freq = 400000,
        },
        .reset_pin = BSP_CAMERA_RST,
        .pwdn_pin = GPIO_NUM_NC,
    };
    const esp_video_init_config_t camera_config = {
        .csi = &csi_config,
    };
    return esp_video_init(&camera_config);
}
